# Analiza i Bazy Danych
## Laboratorium nr 2
### Łączenie z bazą danych i instrukcja select
Wiktor Kacprzak

In [1]:
from sqlalchemy import create_engine

db_string = "postgresql://wbauer_adb:adb2020@pgsql-196447.vipserv.org:5432/wbauer_adb"

db = create_engine(db_string)
connection_sqlalchemy = db.connect()

Zadanie 1

In [2]:
a = db.execute("SELECT COUNT(DISTINCT category_id) FROM film_category")
# Zliczanie niepowtarzalnych kategorii filmów
for i in a:
    print(i[0])

16

Zadanie 2

In [3]:
b = db.execute("SELECT name FROM category ORDER BY name ASC")
# Wypisanie alfabetycznej kolejności kategorii filmów
for i in b:
    print(i[0])

Action
Animation
Children
Classics
Comedy
Documentary
Drama
Family
Foreign
Games
Horror
Music
New
Sci-Fi
Sports
Travel

Zadanie 3

In [4]:
c = db.execute("SELECT MIN(release_year), MAX(release_year) FROM film")
for i in c:
    print(i[0])
#Wszystkie filmy pochodzą z tego samego roku!

2006

Zadanie 4

In [5]:
d = db.execute("SELECT COUNT(1) FROM rental WHERE rental_date BETWEEN '2005-07-01' AND '2005-08-01'")
# Swoją drogą, ciekawe, że wypożyczenia nastąpiły przed datą premiery
for i in d:
    print(i[0])

6709

Zadanie 5

In [6]:
e = db.execute("SELECT COUNT(1) FROM rental WHERE rental_date BETWEEN '2010-01-01' AND '2011-02-01'")
# Brak wypożyczeń w tym okresie
for i in e:
    print(i[0])

0

Zadanie 6

In [7]:
f = db.execute("SELECT * FROM payment WHERE amount = (SELECT MAX(amount) from payment)")
# Wypisanie wszystkich rachunków o najwyżej wartości płatności
for i in f:
    print(i)

(20403, 362, 1, 14759, Decimal('11.99'), datetime.datetime(2007, 3, 21, 21, 57, 24, 996577))
(22650, 204, 2, 15415, Decimal('11.99'), datetime.datetime(2007, 3, 22, 22, 17, 22, 996577))
(23757, 116, 2, 14763, Decimal('11.99'), datetime.datetime(2007, 3, 21, 22, 2, 26, 996577))
(24553, 195, 2, 16040, Decimal('11.99'), datetime.datetime(2007, 3, 23, 20, 47, 59, 996577))
(24866, 237, 2, 11479, Decimal('11.99'), datetime.datetime(2007, 3, 2, 20, 46, 39, 996577))
(28799, 591, 2, 4383, Decimal('11.99'), datetime.datetime(2007, 4, 7, 19, 14, 17, 996577))
(28814, 592, 1, 3973, Decimal('11.99'), datetime.datetime(2007, 4, 6, 21, 26, 57, 996577))
(29136, 13, 2, 8831, Decimal('11.99'), datetime.datetime(2007, 4, 29, 21, 6, 7, 996577))

Zadanie 7

In [8]:
g = db.execute("SELECT customer.first_name, customer.last_name, country.country FROM customer \
               INNER JOIN address USING(address_id) \
               INNER JOIN city USING(city_id) \
               INNER JOIN country USING(country_id) \
               WHERE country IN ('Poland', 'Nigeria', 'Bangladesh') \
               ORDER BY country ASC")
# Wpisanie klientów z poszczególnych krajów z podziałem na kraje
for i in g:
    print(i)

('Michelle', 'Clark', 'Bangladesh')
('Stephen', 'Qualls', 'Bangladesh')
('Frank', 'Waggoner', 'Bangladesh')
('Marilyn', 'Ross', 'Nigeria')
('Elsie', 'Kelley', 'Nigeria')
('Gladys', 'Hamilton', 'Nigeria')
('Sonia', 'Gregory', 'Nigeria')
('Rodney', 'Moeller', 'Nigeria')
('Velma', 'Lucas', 'Nigeria')
('Carol', 'Garcia', 'Nigeria')
('Olga', 'Jimenez', 'Nigeria')
('Bertha', 'Ferguson', 'Nigeria')
('Tracey', 'Barrett', 'Nigeria')
('Jo', 'Fowler', 'Nigeria')
('Wallace', 'Slone', 'Nigeria')
('Constance', 'Reid', 'Nigeria')
('Brian', 'Wyman', 'Poland')
('Sidney', 'Burleson', 'Poland')
('Marjorie', 'Tucker', 'Poland')
('Russell', 'Brinson', 'Poland')
('Leah', 'Curtis', 'Poland')
('Ruben', 'Geary', 'Poland')
('Johnnie', 'Chisholm', 'Poland')
('Jimmie', 'Eggleston', 'Poland')

Zadanie 8

In [9]:
h = db.execute("SELECT staff.first_name, staff.last_name, address.address, city.city, country.country FROM staff \
               INNER JOIN address USING(address_id) \
               INNER JOIN city USING(city_id) \
               INNER JOIN country USING(country_id)")
# Wypisanie pracowników wypożyczalni wraz z ich pełnymi adresami
for i in h:
    print(i)

('Mike', 'Hillyer', '23 Workhaven Lane', 'Lethbridge', 'Canada')
('Jon', 'Stephens', '1411 Lillydale Drive', 'Woodridge', 'Australia')

Zadanie 9

In [10]:
j = db.execute("SELECT COUNT(first_name) FROM staff \
               INNER JOIN address USING(address_id) \
               INNER JOIN city USING(city_id) \
               INNER JOIN country USING(country_id) \
               WHERE country IN ('Argentina', 'Spain')")
# Wypisanie ilości pracowników z Argentyny lub Hiszpani - brak
for i in j:
    print(i[0])

0

Zadanie 10

In [11]:
k = db.execute("SELECT DISTINCT name FROM category \
               INNER JOIN film_category USING(category_id) \
               INNER JOIN film USING(film_id) \
               INNER JOIN inventory USING(film_id) \
               INNER JOIN rental USING(inventory_id) \
               INNER JOIN customer USING(customer_id) ORDER BY name ASC")
# Wypisanie wszystkich kategorii filmów, które zostały wypożyczone przez klientów
for i in k:
    print(i[0])

Action
Animation
Children
Classics
Comedy
Documentary
Drama
Family
Foreign
Games
Horror
Music
New
Sci-Fi
Sports
Travel

Zadanie 11

In [12]:
l = db.execute("SELECT DISTINCT name FROM category \
               INNER JOIN film_category USING(category_id) \
               INNER JOIN film USING(film_id) \
               INNER JOIN inventory USING(film_id) \
               INNER JOIN rental USING(inventory_id) \
               INNER JOIN customer USING(customer_id) \
               INNER JOIN address USING(address_id) \
               INNER JOIN city USING(city_id) \
               INNER JOIN country USING(country_id) \
               WHERE country = 'United States' \
               ORDER BY name ASC")
# Wypisanie wszystkich kategorii filmów wypożyczanych w USA
for i in l:
    print(i[0])

Action
Animation
Children
Classics
Comedy
Documentary
Drama
Family
Foreign
Games
Horror
Music
New
Sci-Fi
Sports
Travel

Zadanie 12

In [13]:
m = db.execute("SELECT DISTINCT title FROM film \
               INNER JOIN film_actor USING(film_id) \
               INNER JOIN actor USING(actor_id) \
               WHERE (first_name, last_name) IN \
               (('Olympia', 'Pfeiffer'), ('Julia', 'Zellweger'), ('Ellen', 'Presley'))")
# Wypisanie wszystkich filmów, w których grał przynajmniej jeden ze wskazanych aktorów
for i in m:
    print(i[0])

Badman Dawn
Bilko Anonymous
Breakfast Goldfinger
Caribbean Liberty
Casper Dragonfly
Chitty Lock
Color Philadelphia
Contact Anonymous
Cranes Reservoir
Dares Pluto
Deep Crusade
Detective Vision
Divorce Shining
Effect Gladiator
Empire Malkovich
Express Lonely
Firehouse Vietnam
Floats Garden
Frogmen Breaking
Fugitive Maguire
Hanky October
Hollow Jeopardy
Homeward Cider
Hyde Doctor
Ice Crossing
Idols Snatchers
Image Princess
Intolerable Intentions
Jacket Frisco
Jeopardy Encino
Lambs Cincinatti
Magnolia Forrester
Majestic Floats
Mars Roman
Maude Mod
Microcosmos Paradise
Minds Truman
Murder Antitrust
Network Peak
None Spiking
Open African
Oscar Gold
Others Soup
Outlaw Hanky
Panky Submarine
Pickup Driving
Pinocchio Simon
Private Drop
Psycho Shrunk
Rider Caddyshack
Roots Remember
Santa Paris
Scarface Bang
Secretary Rouge
Sense Greek
Spy Mile
Storm Happiness
Streetcar Intentions
Sweet Brotherhood
Tadpole Park
Titanic Boondock
Tourist Pelican
Traffic Hobbit
Treasure Command
Turn Star
Wait Cider
Women Dorado
Won Dares
Wyoming Storm